[
  {
    "id": 1,
    "title": "Corte Nacional de Justicia emite resolución sobre prescripción en casos de tránsito",
    "excerpt": "La resolución establece nuevos criterios para determinar la prescripción de acciones en casos de infracciones de tránsito.",
    "content": "<p>La Corte Nacional de Justicia ha emitido una resolución que redefine los plazos y criterios de prescripción aplicables a infracciones de tránsito. Esta decisión busca unificar la práctica judicial y brindar mayor seguridad jurídica.</p><h2>Puntos relevantes</h2><ul><li>Claridad en cómputo de plazos</li><li>Armonización con normativa vigente</li><li>Lineamientos para juzgados de primera instancia</li></ul>",
    "date": "2023-12-18",
    "category": "nacional",
    "image": "/images/news/prescripcion-transito.jpg",
    "author": "Redacción Legal",
    "readTime": 5
  },
  {
    "id": 2,
    "title": "Reformas al COIP: cambios para agilizar procesos penales",
    "excerpt": "Las modificaciones buscan agilizar los procesos penales y fortalecer las garantías procesales de los acusados.",
    "content": "<p>Las reformas al Código Orgánico Integral Penal introducen medidas de simplificación procesal y fortalecimiento de garantías. Se espera una disminución de tiempos y mayor eficiencia.</p>",
    "date": "2023-12-15",
    "category": "penal",
    "image": "/images/news/reformas-coip.jpg",
    "author": "Departamento Jurídico",
    "readTime": 8
  },
  {
    "id": 3,
    "title": "Corte Constitucional declara inconstitucional artículo sobre prisión preventiva",
    "excerpt": "El fallo establece que la aplicación automática de prisión preventiva en ciertos delitos viola principios constitucionales.",
    "content": "<p>La Corte Constitucional ha reiterado la excepcionalidad de la prisión preventiva, subrayando la necesidad de motivación reforzada y análisis de proporcionalidad en cada caso.</p>",
    "date": "2023-12-12",
    "category": "constitucional",
    "image": "/images/news/prision-preventiva.jpg",
    "author": "Ana Martínez",
    "readTime": 6
  },
  {
    "id": 4,
    "title": "Juzgado de Ibarra implementa sistema digital para audiencias virtuales",
    "excerpt": "La iniciativa busca reducir tiempos de espera y facilitar el acceso a la justicia en la provincia de Imbabura.",
    "content": "<p>Con la implementación de audiencias virtuales se optimizan recursos y se mejora la cobertura territorial, garantizando acceso oportuno a la administración de justicia.</p>",
    "date": "2023-12-10",
    "category": "local",
    "image": "/images/news/ibarra-virtual.jpg",
    "author": "Carlos Benítez",
    "readTime": 4
  },
  {
    "id": 5,
    "title": "Consejo de la Judicatura anuncia plan de modernización de juzgados",
    "excerpt": "El plan incluye renovación tecnológica y capacitación para jueces y personal administrativo en todo el país.",
    "content": "<p>El plan de modernización contempla inversión en infraestructura tecnológica y capacitación continua, elevando los estándares de eficiencia y transparencia.</p>",
    "date": "2023-12-08",
    "category": "nacional",
    "image": "/images/news/modernizacion-juzgados.jpg",
    "author": "Redacción Legal",
    "readTime": 7
  },
  {
    "id": 6,
    "title": "Precedente sobre derechos de propiedad en zonas rurales",
    "excerpt": "El fallo sienta un precedente importante para casos similares relacionados con disputas de tierras en zonas rurales.",
    "content": "<p>La decisión reconoce la necesidad de ponderar costumbres locales y títulos históricos, promoviendo soluciones integrales a conflictos de propiedad.</p>",
    "date": "2023-12-05",
    "category": "civil",
    "image": "/images/news/derechos-propiedad.jpg",
    "author": "María Sánchez",
    "readTime": 6
  }
]
